Repository: OPUS4/application
Catalog: modules/admin/language/filebrowser.tmx
Source language: de
Languages: en

source: Dateibrowser
en: Filebrowser

source: Füge Dateien hinzu zum Dokument mit ID
en: Add files to document with id

source: Keine Dateien vorhanden.
en: No files to select.

source: Dateiname
en: Filename

source: Dateigröße
en: Filesize

source: Ausgewählte Dateien importieren
en: Import Selected Files
